In [1]:
import pandas as pd

In [2]:
record1 = pd.Series({'Name': 'Alice',
                        'Class': 'Physics',
                        'Score': 85})
record2 = pd.Series({'Name': 'Jack',
                        'Class': 'Chemistry',
                        'Score': 82})
record3 = pd.Series({'Name': 'Helen',
                        'Class': 'Biology',
                        'Score': 90})

In [9]:
df = pd.DataFrame([record1, record2, record3],
                  index=['school1', 'school2', 'school3'])
df.head()

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school3  Helen    Biology     90

In [10]:
df.loc['school2']

Name          Jack
Class    Chemistry
Score           82
Name: school2, dtype: object

In [11]:
type(df.loc['school2'])

pandas.core.series.Series

In [12]:
df.loc[:,['Name', 'Score']]

          Name  Score
school1  Alice     85
school2   Jack     82
school3  Helen     90

In [13]:
df.drop('school1')

          Name      Class  Score
school2   Jack  Chemistry     82
school3  Helen    Biology     90

In [14]:
df['ClassRanking'] = None

In [15]:
df

          Name      Class  Score ClassRanking
school1  Alice    Physics     85         None
school2   Jack  Chemistry     82         None
school3  Helen    Biology     90         None